## Plan Result (stg_appgateway)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.appgateway.azurerm_application_gateway.ag[0]
  * module.appgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.appgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw"
    }

  # module.appgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw"
        name                              = "aks-fe-00-stg-agw"
        tags                              = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (7 unchanged attributes hidden)

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.148.15.250",
              + "10.148.31.250",
            ]
          + name         = "pre-portal"
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/c100-application" -> null
          - name                                = "c100-application" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/c100-application" -> null
          - probe_name                          = "c100-application" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/darts-portal" -> null
          - name                                = "darts-portal" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/darts-portal" -> null
          - probe_name                          = "darts-portal" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/pip-frontend" -> null
          - name                                = "pip-frontend" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/pip-frontend" -> null
          - probe_name                          = "pip-frontend" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/pip-frontend-b2c-sign-in" -> null
          - name                                = "pip-frontend-b2c-sign-in" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/pip-frontend-b2c-sign-in" -> null
          - probe_name                          = "pip-frontend-b2c-sign-in" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/pip-frontend-b2c-staff" -> null
          - name                                = "pip-frontend-b2c-staff" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/pip-frontend-b2c-staff" -> null
          - probe_name                          = "pip-frontend-b2c-staff" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/portal-stg" -> null
          - name                                = "portal-stg" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/portal-stg" -> null
          - probe_name                          = "portal-stg" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/sds-api-mgmt" -> null
          - name                                = "sds-api-mgmt" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/sds-api-mgmt" -> null
          - probe_name                          = "sds-api-mgmt" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/staging-casetracker" -> null
          - name                                = "staging-casetracker" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/staging-casetracker" -> null
          - probe_name                          = "staging-casetracker" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/staging-certificatedbailiffs" -> null
          - name                                = "staging-certificatedbailiffs" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/staging-certificatedbailiffs" -> null
          - probe_name                          = "staging-certificatedbailiffs" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/staging-courtfines" -> null
          - name                                = "staging-courtfines" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/staging-courtfines" -> null
          - probe_name                          = "staging-courtfines" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/staging-immigrationappealsonline" -> null
          - name                                = "staging-immigrationappealsonline" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/staging-immigrationappealsonline" -> null
          - probe_name                          = "staging-immigrationappealsonline" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/staging-trib-admin-appeals" -> null
          - name                                = "staging-trib-admin-appeals" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/staging-trib-admin-appeals" -> null
          - probe_name                          = "staging-trib-admin-appeals" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/staging-trib-care-standards" -> null
          - name                                = "staging-trib-care-standards" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/staging-trib-care-standards" -> null
          - probe_name                          = "staging-trib-care-standards" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/staging-trib-cicap" -> null
          - name                                = "staging-trib-cicap" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/staging-trib-cicap" -> null
          - probe_name                          = "staging-trib-cicap" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/staging-trib-employment-appeals" -> null
          - name                                = "staging-trib-employment-appeals" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/staging-trib-employment-appeals" -> null
          - probe_name                          = "staging-trib-employment-appeals" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/staging-trib-finance-tax" -> null
          - name                                = "staging-trib-finance-tax" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/staging-trib-finance-tax" -> null
          - probe_name                          = "staging-trib-finance-tax" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/staging-trib-immigration-svcs" -> null
          - name                                = "staging-trib-immigration-svcs" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/staging-trib-immigration-svcs" -> null
          - probe_name                       

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

riteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/vh-admin-web"
          + backend_address_pool_name  = "vh-admin-web"
          + backend_http_settings_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/vh-admin-web"
          + backend_http_settings_name = "vh-admin-web"
          + http_listener_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/httpListeners/vh-admin-web"
          + http_listener_name         = "vh-admin-web"
          + id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/requestRoutingRules/vh-admin-web"
          + name                       = "vh-admin-web"
          + priority                   = 70
          + rewrite_rule_set_id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/vh-video-web"
          + backend_address_pool_name  = "vh-video-web"
          + backend_http_settings_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/vh-video-web"
          + backend_http_settings_name = "vh-video-web"
          + http_listener_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/httpListeners/vh-video-web"
          + http_listener_name         = "vh-video-web"
          + id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/requestRoutingRules/vh-video-web"
          + name                       = "vh-video-web"
          + priority                   = 60
          + rewrite_rule_set_id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "darts-portal"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "darts-portal"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "darts-portal"
          + id                         = (known after apply)
          + name                       = "darts-portal"
          + priority                   = 250
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "portal-stg"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "portal-stg"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "portal-stg"
          + id                         = (known after apply)
          + name                       = "portal-stg"
          + priority                   = 240
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "pre-portal"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "pre-portal"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "pre-portal"
          + id                         = (known after apply)
          + name                       = "pre-portal"
          + priority                   = 80
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sds-api-mgmt"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sds-api-mgmt"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sds-api-mgmt"
          + id                         = (known after apply)
          + name                       = "sds-api-mgmt"
          + priority                   = 130
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "staging-casetracker"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "staging-casetracker"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "staging-casetracker"
          + id                         = (known after apply)
          + name                       = "staging-casetracker"
          + priority                   = 90
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "staging-certificatedbailiffs"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "staging-certificatedbailiffs"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "staging-certificatedbailiffs"
          + id                         = (known after apply)
          + name                       = "staging-certificatedbailiffs"
          + priority                   = 100
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "staging-courtfines"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "staging-courtfines"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "staging-courtfines"
          + id                         = (known after apply)
          + name                       = "staging-courtfines"
          + priority                   = 110
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "staging-immigrationappealsonline"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "staging-immigrationappealsonline"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "staging-immigrationappealsonline"
          + id                         = (known after apply)
          + name                       = "staging-immigrationappealsonline"
          + priority                   = 120
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "staging-trib-admin-appeals"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "staging-trib-admin-appeals"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "staging-trib-admin-appeals"
          + id                         = (known after apply)
          + name                       = "staging-trib-admin-appeals"
          + priority                   = 170
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "staging-trib-care-standards"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "staging-trib-care-standards"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "staging-trib-care-standards"
          + id                         = (known after apply)
          + name                       = "staging-trib-care-standards"
          + priority                   = 180
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "staging-trib-cicap"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "staging-trib-cicap"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "staging-trib-cicap"
          + id                         = (known after apply)
          + name                       = "staging-trib-cicap"
          + priority                   = 230
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "staging-trib-employment-appeals"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "staging-trib-employment-appeals"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "staging-trib-employment-appeals"
          + id                         = (known after apply)
          + name                       = "staging-trib-employment-appeals"
          + priority                   = 210
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "staging-trib-finance-tax"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "staging-trib-finance-tax"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "staging-trib-finance-tax"
          + id                         = (known after apply)
          + name                       = "staging-trib-finance-tax"
          + priority                   = 200
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "staging-trib-immigration-svcs"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "staging-trib-immigration-svcs"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "staging-trib-immigration-svcs"
          + id                         = (known after apply)
          + name                       = "staging-trib-immigration-svcs"
          + priority                   = 150
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "staging-trib-info-rights"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "staging-trib-info-rights"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "staging-trib-info-rights"
          + id                         = (known after apply)
          + name                       = "staging-trib-info-rights"
          + priority                   = 160
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "staging-trib-land-reg-division"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "staging-trib-land-reg-division"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "staging-trib-land-reg-division"
          + id                         = (known after apply)
          + name                       = "staging-trib-land-reg-division"
          + priority                   = 140
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "staging-trib-lands-chamber"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "staging-trib-lands-chamber"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "staging-trib-lands-chamber"
          + id                         = (known after apply)
          + name                       = "staging-trib-lands-chamber"
          + priority                   = 190
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "staging-trib-tansport-appeals"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "staging-trib-tansport-appeals"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "staging-trib-tansport-appeals"
          + id                         = (known after apply)
          + name                       = "staging-trib-tansport-appeals"
          + priority                   = 220
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

        # (32 unchanged blocks hidden)
    }

  # module.appgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":536,"Program":"tfcmt","SHA1":"","Target":"stg_appgateway","Vars":{}} -->